/**
 * http://fecore.net.ua/books/m5ph3r-javascript/module-02/scope.html
 * http://fecore.net.ua/books/m5ph3r-javascript/module-04/closures.html
 * Измените анонимную функцию которая присваивается к result[i]
 * так, чтобы в результате в консоли мы послучили числа от 0 до 4 включительно
 * Изменять можно только функцию 
 * function () {
    console.log(i);
  };
 */

const result = [];

// function func(i) {
//   return function () {
//     console.log(i);
//   };
// }

// for (var i = 0; i < 5; i++) {
//   result[i] = func(i);
// }

///////////////////////////////////////////////

// for (var i = 0; i < 5; i++) {
//   result[i] = (function (index) {
//     return function () {
//       console.log(index);
//     };
//   })(i);
// }

////////////////////////////////////////////////

// for (var i = 0; i < 5; i++) {
//   result[i] = console.log.bind(this, i);
// }
/////////////////////////////////////////////////////////////

for (var i = 0; i < 5; i++) {
  result[i] = function () {
    j = i++ - result.length;
    console.log(j);
  };
}

//-----------------------------------------------

result[0](); // 5, ожидаем 0
result[1](); // 5, ожидаем 1
result[2](); // 5, ожидаем 2
result[3](); // 5, ожидаем 3
result[4](); // 5, ожидаем 4
///////////////////////////////////////////////

// for (var i = 0; i < 5; i++) {
//   result[i] = function () {
//     console.log(i);
//   }.call(this, i);
// }

//////////////////////////////////////////////////////

//var - одна и та же переменная в которой одно значение перезаписывается (обновляется) на каждой итерации
//let - на каждой итерации создаётся новое значение, как бы создаётся новая переменная со своим значением (сколько итераций - столько и значений)
